# ColorFillFilteredParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ColorFillFilteredParam Property
ParameterTypeId Class See Also
---
"Values Displayed"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ColorFillFilteredParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ColorFillFilteredParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ColorFillFilteredParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace